---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange.BoltDiameter
source: html/cf402a50-315f-5301-7979-e5731bf6587b.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange.BoltDiameter Property

Maximum bolt hole diameter, in. (mm)

## Syntax (C#)
```csharp
public double BoltDiameter { get; set; }
```